УТ_для_edt/src/InformationRegisters/CRM_ЗадачиПоИсправлениюКлиентскойБазы/CRM_ЗадачиПоИсправлениюКлиентскойБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ЗадачиПоИсправлениюКлиентскойБазы</name>
  <resources>
    <name>Завершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидКонтроля</name>
    <type>
      <types>EnumRef.CRM_ВидыМастераПроверкиКлиентскойБазы</types>
    </type>
  </resources>
  <resources>
    <name>Контролер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </resources>
  <attributes>
    <name>ПартнерРодитель</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <dimensions>
    <name>БизнесПроцесс</name>
    <comment>АПК:1208 имя корректное</comment>
    <type>
      <types>BusinessProcessRef.CRM_БизнесПроцесс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      <types>DocumentRef.УдалитьCRM_Событие</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_ЗадачиПоИсправлениюКлиентскойБазы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Это задача по исправлению клиентской базы
//  Возвращает вид задачи по исправлению клиентской базы.
//
// Параметры:
//  Задача	 - ЗадачаСсылка.ЗадачаИсполнителя	 - Ссылка на задачу, для которой необходимо получить вид задачи. 
// 
// Возвращаемое значение:
//  ВидКонтроля - ПеречислениеСсылка.CRM_ВидыМастераПроверкиКлиентскойБазы - Вид задачи по исправлению клиентской базы.
//
Функция ЭтоЗадачаПоИсправлениюКлиентскойБазы(Задача) Экспорт
	Если	ТипЗнч(Задача) <> Тип("ЗадачаСсылка.ЗадачаИсполнителя")
		Или	Не ЗначениеЗаполнено(Задача)
		Или	Не ЗначениеЗаполнено(Задача.БизнесПроцесс) Тогда
		//
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1 РАЗРЕШЕННЫЕ
	|	ВидКонтроля КАК ВидКонтроля
	|ИЗ
	|	РегистрСведений.CRM_ЗадачиПоИсправлениюКлиентскойБазы
	|ГДЕ
	|	БизнесПроцесс = &БизнесПроцесс
	|");
	Запрос.УстановитьПараметр("БизнесПроцесс", Задача.БизнесПроцесс);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВидКонтроля;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

#КонецОбласти


#КонецЕсли
